---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.FabricLocation
source: html/fc995172-e9d1-10a0-9c95-29f5a7ead0a2.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.FabricLocation Property

The Fabric location in the host.

## Syntax (C#)
```csharp
public FabricLocation FabricLocation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration